БухЭксп/Documents/CW_ЗакрытиеГрузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ЗакрытиеГрузоперевозки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_ПеревыставлениеПоСтавкам</xr:Item>
				<xr:Item>AccumulationRegister.CW_ВознаграждениеПоГрузоперевозкам</xr:Item>
				<xr:Item>AccumulationRegister.CW_ДоходыПоГрузоперевозкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытиеПоЗаказу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодробноеПредставлениеНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируетсяАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируетсяСчетФактура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомыйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСпособаВыставления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вознаграждение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходыПоГрузоперевозке</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходыПоГрузоперевозке</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокПрисвоенияИсходящихНомеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокПрисвоенияИсходящихНомеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СплошнаяНумерация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПределахДаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НезависимаяНумерация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПределахДатыАктыНезависимые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийНумератор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_ЗакрытиеГрузоперевозки/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ОсновныеСобытияФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	
	
	ВалютаРегламентированногоУчетаРубль = ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");
	
	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	Элементы.ПодразделениеОрганизации.Видимость	= ВестиУчетПоПодразделениям;
	//Для версии КОРП
	
	_СформироватьЗаголовок();
	_СформироватьОбщиеПараметры();
	Валюта = _ДС().КО.ВалютаРегламентированногоУчета;
	
	Если (Объект.Ссылка.Пустая()) Тогда
		
		Если (ЗначениеЗаполнено(Объект.Аналитика) И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования)) Тогда
			
			// определяем платильщика и договор
			МассивПлательщиков = Новый Массив;
			Если (Объект.ЗакрытиеПоЗаказу) Тогда
				
				// пробегаемся по грузопервозкам заказа и определяем плательщика
				МассивГП = CW_Мониторинг.ГрузоперевозкиЗаказа(Объект.Аналитика);
				
				Для каждого ГП Из МассивГП Цикл
					
					Если ТипЗнч(ГП) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
						тКлиент = ГП.Клиент;
					Иначе
						тКлиент = ГП.Контрагент;
					КонецЕсли;
					
					СтруктураПараметров = Новый Структура;
					СтруктураПараметров.Вставить("Объект"				, ГП);
					СтруктураПараметров.Вставить("ЭтоВариантБюджета"	, Ложь);
					СтруктураПараметров.Вставить("Контрагент"			, тКлиент);
					
					Плательщик = CW_Финансы.ВернутьПлательщика(СтруктураПараметров);
					Если (ЗначениеЗаполнено(Плательщик)) Тогда
						_сф.м_ДобавитьУникально(МассивПлательщиков,Плательщик);
					КонецЕсли; 
					
				КонецЦикла; 
				
			Иначе
				тАналитика = Объект.Аналитика;
				
				Если ТипЗнч(тАналитика) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
					тКлиент = тАналитика.Клиент;
				Иначе
					тКлиент = тАналитика.Контрагент;
				КонецЕсли;
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Объект"				, тАналитика);
				СтруктураПараметров.Вставить("ЭтоВариантБюджета"	, Ложь);
				СтруктураПараметров.Вставить("Контрагент"			, тКлиент);
				
				Плательщик = CW_Финансы.ВернутьПлательщика(СтруктураПараметров);
				
				Если (ЗначениеЗаполнено(Плательщик)) Тогда
					_сф.м_ДобавитьУникально(МассивПлательщиков,Плательщик);
				КонецЕсли; 
					
			КонецЕсли; 
			КоличествоПлательщиков = _сф.Количество(МассивПлательщиков);
			Если (КоличествоПлательщиков <> 0) Тогда
				
				
				Если (КоличествоПлательщиков = 1) Тогда
					
					Объект.Контрагент = МассивПлательщиков[0];
					_УстановитьДоговор();					
					
				Иначе
					
					Плательщики.Очистить();
					Для каждого Стр Из МассивПлательщиков Цикл
						Плательщики.Добавить(Стр);
					КонецЦикла; 
					РежимВыбораПлательщика = Истина;
					Возврат;
					
				КонецЕсли; 				
				
			КонецЕсли; 
			
			
		КонецЕсли; 
		
		Если ВестиУчетПоПодразделениям и Не ЗначениеЗаполнено(Объект.ПодразделениеОрганизации) Тогда
			Объект.ПодразделениеОрганизации 	= CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ПодразделениеПользователя");
		КонецЕсли;
	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Договор) тогда
		
		СтруктураПараметровБухУчета = Новый Структура;
		СтруктураПараметровБухУчета.Вставить("Договор", 				Объект.Договор);
		СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		Объект.ПриложениеКДоговору);
		
		ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Объект.Дата);
		
		ВедетсяБУпоДоговору = ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет;
	Конецесли;
	
	Если (НЕ РежимВыбораПлательщика) Тогда
		_ИнициализацияФормы();	
	КонецЕсли; 
	
	// --- 
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	// --- 
	НачальнаяДатаДокумента = Объект.Дата;
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.УчетПриложенийДоговоров
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ФормируетсяАкт = Истина;
	КонецЕсли;
	
	ПервичныеДокументыПриСозданииНаСервере();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура _ИнициализацияФормы()
	// --- 
	
	Если (Объект.Организация.Пустая()) Тогда
		
		ОсновнаяОрганизация = CW_Настройки.ОсновнаяОрганизация();
		Если ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
			Объект.Организация = ОсновнаяОрганизация;
			_СформироватьОбщиеПараметры("УчетнаяПолитика");
		КонецЕсли;
		
	КонецЕсли; 
	
	Элементы.ГруппаИнфо.Видимость = Ложь;
	// проверяем на закрытие
	Если НЕ РеквизитФормыВЗначение("Объект").ПроверитьЗакрытиеГрузоперевозок() Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.ГруппаИнфо.Видимость = Истина;
		Элементы.ГруппаКлиент.ТолькоПросмотр=Истина;
		Элементы.ПолучитьНомер.Доступность = Ложь;
		Элементы.ДекорацияИнфо.Заголовок = "Документ доступен только для просмотра, т.к. содержит блокированные грузоперевозки!";
	КонецЕсли; 
	
	ВариантЗакрытия = ?(Объект.ЗакрытиеПоЗаказу,0,1);
	Если (Объект.Ссылка.Пустая()) Тогда
		_ВариантЗакрытияПриИзменении();
	КонецЕсли; 
	
	ПравоПросмотраБухгалтерскихОбъектов = CW_ПраваДоступа.ДоступныОбъектыБухгалтерии();
	Элементы.ГруппаВедомыйДокумент.Видимость = ПравоПросмотраБухгалтерскихОбъектов и ПолучитьФункциональнуюОпцию("CW_ИспользуетсяБухгалтерскийУчетПоДоговору");
	
	_ОбновитьНомераДокументов();
	_УправлениеЭлементамиФормы();
	
	ОбновитьИтогиПоРасходам();
	ОбновитьИтогиПоДоходам();
	ОбновитьИтогиПоВознаграждению();
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	// ---------------------------------------------------------------------------- 
	
	Если (РежимВыбораПлательщика) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораПлательщика",ЭтотОбъект); 
		Плательщики.ПоказатьВыборЭлемента(ПОВ,"Выберите плательщика");
		
		_СформироватьОбщиеПараметры();
		_ИнициализацияФормы();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПлательщика(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		Объект.Контрагент = Ответ.Значение;
		_УстановитьДоговор();
		_СформироватьОбщиеПараметры();
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// --- 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	_СформироватьЗаголовок();
	_ОбновитьНомераДокументов();
	_УправлениеЭлементамиФормы();
	
	ПодготовитьДанныеФормы();

// --- 
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьДанныеФормы();	
	
	//ДатыЗапретаИзменения
	//Проверяем дату запрета по документам БУ
	мОбъектыПроверки = ПолучитьМассивОбъектовДляПроверки();
	Для Каждого ЭлементМассива из мОбъектыПроверки Цикл
		//Есть ведомые документы, проверяем дату запрета редактирования БП
		ОбъектМассива = ЭлементМассива.ПолучитьОбъект();
		Разрешено = ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ОбъектМассива);
		Если не Разрешено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//ДатыЗапретаИзменения

	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивОбъектовДляПроверки()
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.ВедомыйДокумент) Тогда
		Результат.Добавить(Объект.ВедомыйДокумент);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВедомыйСчетФактура) Тогда
		Результат.Добавить(Объект.ВедомыйСчетФактура);
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции


#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область ИнициализацияФормы 

&НаСервере
Процедура _СформироватьЗаголовок()
	
	ЗаголовокДокумента = 
		"Выявление финансового результата " + 
		?(ЗначениеЗаполнено(Объект.Ссылка), " "+Объект.Номер+" от "+Объект.Дата, " (создание)")
	;
	ЭтаФорма.Заголовок = ЗаголовокДокумента;
	
КонецПроцедуры

&НаСервере
Процедура _УстановитьДоговор()
	// --- 
	
	// пробуем получить договор с покупателем
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_ДоговорыПоГрузоперевозкам.Ссылка,
	               |	CW_ДоговорыПоГрузоперевозкам.ДатаДоговора
	               |ИЗ
	               |	Справочник.CW_ДоговорыПоГрузоперевозкам КАК CW_ДоговорыПоГрузоперевозкам
	               |ГДЕ
	               |	CW_ДоговорыПоГрузоперевозкам.ВидДоговора = &ВидДоговора
	               |	И CW_ДоговорыПоГрузоперевозкам.Владелец = &Владелец
	               |	И CW_ДоговорыПоГрузоперевозкам.ПометкаУдаления = ЛОЖЬ
	               |	И ВЫБОР
	               |			КОГДА CW_ДоговорыПоГрузоперевозкам.СрокДействияДоговора = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ CW_ДоговорыПоГрузоперевозкам.СрокДействияДоговора > &ТекущаяДата
	               |		КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CW_ДоговорыПоГрузоперевозкам.ДатаДоговора УБЫВ";
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	Запрос.УстановитьПараметр("Владелец", Объект.Контрагент); 
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата()); 
	ТЗ = Запрос.Выполнить().Выгрузить();
	КоличествоДоговоров = _сф.Количество(ТЗ);
	Если (КоличествоДоговоров=0) Тогда
		// ничего не делаем
	Иначе
		Объект.Договор = ТЗ[0].Ссылка;
		Объект.Организация = Объект.Договор.Организация;
		_СформироватьОбщиеПараметры();   
		
		//Подсистема.УчетПриложенийДоговоров
		CW_УчетПриложенийДоговоровСервер.ПриИзмененииДоговораНаСервере(ЭтаФорма);
		//Подсистема.УчетПриложенийДоговоров
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ОбщиеПараметры 

Функция _ДС()
	// --- 
	
	Возврат(ДС[0].Значение);
	
	// --- 
КонецФункции

&НаСервере
Процедура _СформироватьОбщиеПараметры(СписокПараметров=Неопределено)
	// --- 
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.СформироватьОбщиеПараметры(СписокПараметров);
	
	Если СписокПараметров = Неопределено Тогда
		ДС.Очистить();
		ДС.Добавить(ДокументОбъект.ДополнительныеСвойства);
	Иначе
		
		СоответствиеПарамеров = Новый Соответствие;
		СоответствиеПарамеров.Вставить("ПараметрыДоговора","ПД");
		СоответствиеПарамеров.Вставить("Константы","КО");
		СоответствиеПарамеров.Вставить("УчетнаяПолитика","УП");
		СоответствиеПарамеров.Вставить("НастройкиПользователя","НП");
		
		МассивПараметров = _сф.м_СоздатьИзСтроки(СписокПараметров,",");
		
		ДСС = _ДС();
		
		Для каждого Параметр Из МассивПараметров Цикл
			
			Ключ = СоответствиеПарамеров.Получить(Параметр);
			_сф.ст_УстановитьСвойство(ДСС,Ключ,ДокументОбъект.ДополнительныеСвойства[Ключ]);
			
		КонецЦикла; 
		
		ДС.Очистить();
		ДС.Добавить(ДСС);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область УправлениеЭлементамиФормы

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	Элементы.СтраницаКомментарий.Заголовок = " Комментарий" +?(ЗначениеЗаполнено(Объект.Комментарий)," (*)","");
	Элементы.Аналитика.Заголовок = ?(ВариантЗакрытия = 0, "Заказ","Грузоперевозка");
	
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 
// РЕКВИЗИТЫ
// ----------------------------------------------------------------------------  

#Область ПакетДокументов 

&НаСервере
Процедура _ОбновитьНомераДокументов()
	
	// если номер акта не задан, то дата акта принудительно будет установлена равной дате документа
	Если (ЗначениеЗаполнено(Объект.НомерАкта)) Тогда
		ПредставлениеНомераАкта = СокрЛП(Объект.НомерАкта);
	Иначе
		ПредставлениеНомераАкта = "<...>";			
	КонецЕсли; 
	ПредставлениеДатыАкта = ?(Объект.ДатаАкта = Дата(1,1,1),"<...>",Формат(Объект.ДатаАкта,"ДФ=dd.MM.yyyy"));
	ПредставлениеАкта = "Отчёт экспедитора №" + ПредставлениеНомераАкта + " от " + ПредставлениеДатыАкта;
	
	// с/ф не формируется  
	Если Объект.ФормируетсяСчетФактура Тогда
		
		Если (ЗначениеЗаполнено(Объект.НомерСчетаФактуры)) Тогда
			ПредставлениеНомераСФ = СокрЛП(Объект.НомерСчетаФактуры);
		Иначе
			ПредставлениеНомераСФ = "<...>";			
		КонецЕсли; 
		ПредставлениеДатыСФ = ?(Объект.ДатаСчетаФактуры = Дата(1,1,1),"<...>",Формат(Объект.ДатаСчетаФактуры,"ДФ=dd.MM.yyyy"));
		
		ПредставлениеСчетаФактуры = "С/ф №" + ПредставлениеНомераСФ+" от " + ПредставлениеДатыСФ;
		
	// c/ф не формируется
	Иначе
		ПредставлениеСчетаФактуры = "<С/ф не формируется>";
	КонецЕсли; 
	
	ВедомыйДокументРеализация = Строка(Объект.ВедомыйДокумент);
	ВедомыйДокументСчетФактура = Строка(Объект.ВедомыйСчетФактура);
	
КонецПроцедуры

#КонецОбласти 

#Область ИзменениеОрганизации 

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	_ОрганизацияПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура _ОрганизацияПриИзменении()
	// --- 
	
	_СформироватьОбщиеПараметры("УчетнаяПолитика");
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ИзменениеДаты 

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	_ДатаПриИзменении();
	
	// ---------------------------------------------------------------------------- 
	
	Если (НЕ Объект.Ссылка.Пустая()) Тогда
		
		Если (_ГодИзменился()) Тогда
			
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаИзмененияГода",ЭтотОбъект, Новый Структура()); 
			ПоказатьВопрос(ПОВ,"Дата документа перенесена в другой год."+Символы.ПС+ 
			"Документу будет присвоен новый номер."+Символы.ПС+ 
			"Продолжить?",РежимДиалогаВопрос.ДаНет);
			
		Иначе
			
			ДиалогСменыДатыВедомых();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаИзмененияГода(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			// присваевам новый номер
			_ОбработатьИзменениеГода();
			ДиалогСменыДатыВедомых(); 
			
		Иначе
			
			// восстанавливаем дату по ссылке
			_ВосстановитьДатуДокумента();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОбработатьИзменениеГода()
	// --- 
	
	НачальнаяДатаДокумента = Объект.Дата;
	// --- 
	_ПолучитьНомер();
	
	// --- 
КонецПроцедуры
 

&НаСервере
Процедура _ВосстановитьДатуДокумента()
	// --- 
	
	Объект.Дата = НачальнаяДатаДокумента;
	_ДатаПриИзменении();
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ГодИзменился()
	// --- 
	
	Возврат(Год(Объект.Дата) <> Год(НачальнаяДатаДокумента));
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ДиалогСменыДатыВедомых()
	// --- 
	
	Если (Объект.ФормируетсяАкт ИЛИ Объект.ФормируетсяСчетФактура) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаПодтвержденияСменыДатыВедомых",ЭтотОбъект, Новый Структура()); 
		ПоказатьВопрос(ПОВ,"Изменить даты первичных документов?",РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодтвержденияСменыДатыВедомых(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			_ИзменитьДатыВедомых();
			
			// спросим об изменении номеров ведомых
			ПОВ = Новый ОписаниеОповещения("ОбработкаПодтвержденияСменыНомеровВедомых",ЭтотОбъект, Новый Структура()); 
			ПоказатьВопрос(ПОВ,"Изменить номера ведомых документов?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ИзменитьДатыВедомых()
	// --- 
	
	Если (Объект.ФормируетсяАкт) Тогда
		
		Объект.ДатаАкта = Объект.Дата;
		
	КонецЕсли; 
	Если (Объект.ФормируетсяСчетФактура) Тогда
		
		Объект.ДатаСчетаФактуры = Объект.Дата;
		
	КонецЕсли; 
	
	// --- 
	
	_ОбновитьНомераДокументов();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодтвержденияСменыНомеровВедомых(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			ВыполнитьСменуНомеровВедомыхДокументов();
			
		КонецЕсли; 
		
	КонецЕсли; 	
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура ВыполнитьСменуНомеровВедомыхДокументов()
	// --- 
	
	Если (Объект.ФормируетсяАкт) Тогда
		
		_УстановитьНомерАкта();
		
	КонецЕсли;
	// --- 
	Если (Объект.ФормируетсяСчетФактура) Тогда
		
		_УстановитьНомерСчетаФактуры();
		
	КонецЕсли;
	
	_ОбновитьНомераДокументов();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _УстановитьНомерАкта()
	
	ПорядокПрисвоенияНомеров = _ДС().УП.ПорядокПрисвоенияНомеров;
	ВнешнийНумератор = _ДС().УП.ВнешнийНумератор;
	
	Если (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты) ИЛИ
		 (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация) 
	Тогда
		
		Объект.НомерАкта = Объект.Номер;
		
	ИначеЕсли (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация) Тогда 
		
		НовыйАкт = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйАкт.Организация = Объект.Организация;
		НовыйАкт.Дата = Объект.ДатаАкта;
		НовыйАкт.УстановитьНовыйНомер();
		// --- 
		Объект.НомерАкта = НовыйАкт.Номер;
		НовыйАкт = Неопределено;
		
	ИначеЕсли (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор) Тогда 
		
		ОбработкаНумерации = _ПО.ПолучитьОбработку(ВнешнийНумератор);
		ОбработкаНумерации.УстановитьНомерАкта(Объект);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _УстановитьНомерСчетаФактуры()
	
	ПорядокПрисвоенияНомеров = _ДС().УП.ПорядокПрисвоенияНомеров;
	ВнешнийНумератор = _ДС().УП.ВнешнийНумератор;
	
	Если (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты) ИЛИ
		 (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация) 
	Тогда
		
		Объект.НомерСчетаФактуры = Объект.Номер;
		
	ИначеЕсли (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация) Тогда 
		
		НовыйСФ = Документы.СчетФактураВыданный.СоздатьДокумент();
		НовыйСФ.ВидСчетаФактуры=Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию;
		НовыйСФ.Организация = Объект.Организация;
		НовыйСФ.Дата = Объект.ДатаСчетаФактуры;
		НовыйСФ.УстановитьНовыйНомер();
		// --- 
		Объект.НомерСчетаФактуры = НовыйСФ.Номер;
		НовыйСФ = Неопределено;
		
	ИначеЕсли (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор) Тогда 
		
		ОбработкаНумерации = _ПО.ПолучитьОбработку(ВнешнийНумератор);
		ОбработкаНумерации.УстановитьНомерСчетаФактуры(Объект);
	
	КонецЕсли; 
	
КонецПроцедуры


&НаСервере
Процедура _ДатаПриИзменении()
	// --- 
	
	_СформироватьОбщиеПараметры("ПараметрыДоговора,УчетнаяПолитика");
	
	// --- 
КонецПроцедуры
 
#КонецОбласти 

#Область ИзменениеКонтрагента 

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	_КонтрагентПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура _КонтрагентПриИзменении()
	// --- 
	
	Если (ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(Объект.Организация)) Тогда 
		Объект.Договор = CW_Документы.ПолучитьПоследнийДоговор(Объект.Контрагент, Объект.Организация, Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		
		Если ЗначениеЗаполнено(Объект.Договор) Тогда
			_ДоговорПриИзменении();
			_СформироватьОбщиеПараметры("ПараметрыДоговора");
		КонецЕсли;
		
	КонецЕсли;
	
	_ВариантЗакрытияПриИзменении();
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииКонтрагентаНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ИзменениеДоговора 

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	_ДоговорПриИзменении();
КонецПроцедуры

&НаСервере
Процедура _ДоговорПриИзменении()
	// --- 
	
	_СформироватьОбщиеПараметры();
	
	Если (Объект.Контрагент <> Объект.Договор.Владелец) Тогда
		Объект.Контрагент = Объект.Договор.Владелец;
	КонецЕсли; 
	Если (Объект.Организация <> Объект.Договор.Организация) Тогда
		Объект.Организация = Объект.Договор.Организация;
		_СформироватьОбщиеПараметры("УчетнаяПолитика");
	КонецЕсли; 
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииДоговораНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ИзменениеВариантаЗакрытия 

&НаКлиенте
Процедура ВариантЗакрытияПриИзменении(Элемент)
	
	_ВариантЗакрытияПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура _ВариантЗакрытияПриИзменении()
	// --- 
	
	Объект.ЗакрытиеПоЗаказу = ?(ВариантЗакрытия=0,Истина,Ложь);
	
	// очищаем все ТЧ
	Объект.Вознаграждение.Очистить();
	Объект.Расходы.Очистить();
	Объект.Доходы.Очистить();
	
	Если Объект.ЗакрытиеПоЗаказу Тогда
		
		Если ТипЗнч(Объект.Аналитика)=Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
			
			Если НЕ Объект.Аналитика.Пустая() Тогда
				
				Объект.Аналитика = Объект.Аналитика.Заказ;
				
			Иначе
				
				Объект.Аналитика = Справочники.CW_Заказы.ПустаяСсылка();
				
			КонецЕсли; 
			
		Иначе
			
			Если ТипЗнч(Объект.Аналитика) <> Тип("СправочникСсылка.CW_Заказы") Тогда
				
				Объект.Аналитика = Справочники.CW_Заказы.ПустаяСсылка();
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	Иначе
		
		Если ТипЗнч(Объект.Аналитика) <> Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
			
			Объект.Аналитика = Справочники.CW_Грузоперевозки.ПустаяСсылка();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
	
	// изменяем тип
	_УправлениеЭлементамиФормы();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура АналитикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимВыбора", 			Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", 	Ложь);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", 	Истина);
	ПараметрыФормыВыбора.Вставить("Клиент", 			 	Объект.Контрагент);
	
	//по заказу(0), по грузоперевозке(1)
	Если ВариантЗакрытия = 0 Тогда
		ОткрытьФорму("Справочник.CW_Заказы.ФормаВыбора", ПараметрыФормыВыбора,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора", ПараметрыФормыВыбора,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ИзменениеОтветственного 

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	_ОтветственныйПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура _ОтветственныйПриИзменении()
	// --- 
	
	Объект.Исполнитель = CW_Настройки.ПолучитьФизЛицоПользователя(Объект.Ответственный);
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ИзменениеКомментария

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти 

#Область ФормированиеПредставления

&НаКлиенте
Процедура УслугиПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	_УслугиПредставлениеНачалоВыбора(Элементы.Вознаграждение.ТекущаяСтрока);
	Элементы.Вознаграждение.ТекущийЭлемент = Элементы.ВознаграждениеПредставление;
	
КонецПроцедуры

&НаСервере
Процедура _УслугиПредставлениеНачалоВыбора(Строка)
	// --- 
	
	СтрокаТЧ = Объект.Вознаграждение.НайтиПоИдентификатору(Строка);
	
	ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
	
	ПараметрыШаблона.Номенклатура 	= СтрокаТЧ.Номенклатура;
	ПараметрыШаблона.Объект 		= Объект;
	ПараметрыШаблона.Дата 			= Объект.Дата;
	ПараметрыШаблона.Договор 		= Объект.Договор;
	ПараметрыШаблона.ВидДоговора 	= Объект.Договор.ВидДоговора;
	ПараметрыШаблона.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
	
	CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(СтрокаТЧ, ПараметрыШаблона); 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ПереформироватьПредставлениеУслуг(Знач Строки)
	// --- 
	
	Для каждого Идентификатор Из Строки Цикл
		
		_УслугиПредставлениеНачалоВыбора(Идентификатор);
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры
 

&НаКлиенте
Процедура Услуги_ПереформироватьПредставление(Команда)
	
	_ПереформироватьПредставлениеУслуг(Элементы.Вознаграждение.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти
// ---------------------------------------------------------------------------- 

#Область СлужебныеФункции

&НаКлиенте
Процедура ПересчитатьСуммыСтроки(ТД)

	Если ТД.Свойство("Цена") Тогда
		ТД.Сумма  = ТД.Цена * ТД.Количество;
	КонецЕсли;
	
	ТД.НДС    = ТД.Сумма * СтавкаНДС(ТД.СтавкаНДС)/100;
	ТД.Всего  = ТД.Сумма + ТД.НДС;
	
КонецПроцедуры

&НаКлиенте
Функция СтавкаНДС(Ставка)
	
	Возврат CW_Финансы.ПолучитьСтавкуНДС(Ставка);
	
КонецФункции

#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область ТаблицаРасходы 

&НаКлиенте
Процедура РасходыПриИзменении(Элемент)
	
	ОбновитьИтогиПоРасходам();
	
КонецПроцедуры

Процедура ОбновитьИтогиПоРасходам()
	
	// итоговая строка по табличной части "Услуги" 
	СВ = Строка(Валюта);
	ФЧ = "ЧЦ=15; ЧДЦ=2; ЧН=";
	Элементы.СтраницаРасходы.Заголовок = "Расходы ("+Строка(Объект.Расходы.Количество())+")";
	Если Объект.Расходы.Количество() = 0 Тогда
		ИтогоПоРасходам = "Нет данных.";
	Иначе
		СуммаРасходов = Объект.Расходы.Итог("Всего");
		РасчетноеВознаграждение = СуммаДоходов-СуммаРасходов;
		ИтогоПоРасходам =	"Строк: "+Объект.Расходы.Количество()+
						";  Сумма: "+Формат(Объект.Расходы.Итог("Сумма"),ФЧ)+" "+СВ+ 
						";  НДС: "+Формат(Объект.Расходы.Итог("НДС"),ФЧ)+" "+СВ+
						";  Всего: "+Формат(Объект.Расходы.Итог("Всего"),ФЧ)+" " +СВ;
	КонецЕсли;
	
						
КонецПроцедуры

// --- 

&НаКлиенте
Процедура РасходыНоменклатураПриИзменении(Элемент)
	
	_РасходыНоменклатураПриИзменении(Элементы.Расходы.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура _РасходыНоменклатураПриИзменении(Строка)
	// --- 
	
	СтрокаТЧ = Объект.Расходы.НайтиПоИдентификатору(Строка);
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда 
		
		Если _ДС().НП.ПодставлятьСтавкуНДС Тогда
			СтрокаТЧ.СтавкаНДС =  CW_БухгалтерияЭкспедитораСерверПереопределяемый.СтавкаНДС(СтрокаТЧ.Номенклатура, Объект.Дата);
		КонецЕсли;
		//СтрокаТЧ.СтатьяЗатрат = СтрокаТЧ.Номенклатура.СтатьяЗатрат;

	КонецЕсли;
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ОчиститьРасходы(Команда)
	
	Объект.Расходы.Очистить();
	ОбновитьИтогиПоРасходам();
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыСуммаПриИзменении(Элемент)
	
	ТД=Элементы.Расходы.ТекущиеДанные;
	ТД.НДС = ТД.Сумма * СтавкаНДС(ТД.СтавкаНДС)/100;
	ТД.Всего = ТД.Сумма + ТД.НДС;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыСтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСуммыСтроки(Элементы.Расходы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыНДСПриИзменении(Элемент)
	
	ТД = Элементы.Расходы.ТекущиеДанные;
	
	Если НЕ _ДС().НП.ОбратныйПересчетВДокументах Тогда
		ТД.Всего = ТД.Сумма + ТД.НДС;
	Иначе
		ТД.Сумма = ТД.Всего - ТД.НДС;
//		ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыВсегоПриИзменении(Элемент)
	
	ТД = Элементы.Расходы.ТекущиеДанные;
	
	Ставка = СтавкаНДС(ТД.СтавкаНДС)/100;
	ТД.НДС = ТД.Всего*Ставка/(1+Ставка);
	ТД.Сумма = ТД.Всего - ТД.НДС;
//	ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область ТаблицаДоходы 

&НаКлиенте
Процедура ДоходыПриИзменении(Элемент)
	
	ОбновитьИтогиПоДоходам();
	
КонецПроцедуры

Процедура ОбновитьИтогиПоДоходам()
	
	// итоговая строка по табличной части "Услуги" 
	СВ = Строка(Валюта);
	ФЧ = "ЧЦ=15; ЧДЦ=2; ЧН=";
	Элементы.СтраницаДоходы.Заголовок = "Доходы ("+Строка(Объект.Доходы.Количество())+")";
	Если Объект.Доходы.Количество() = 0 Тогда
		ИтогоПоДоходам = "Нет данных.";
	Иначе
		СуммаДоходов = Объект.Доходы.Итог("Всего");
		РасчетноеВознаграждение = СуммаДоходов-СуммаРасходов;
		ИтогоПоДоходам = "Строк: "+Объект.Доходы.Количество()+
						";  Сумма: "+Формат(Объект.Доходы.Итог("Сумма"),ФЧ)+" "+СВ+ 
						";  НДС: "+Формат(Объект.Доходы.Итог("НДС"),ФЧ)+" "+СВ+
						";  Всего: "+Формат(Объект.Доходы.Итог("Всего"),ФЧ)+" " +СВ;
	КонецЕсли;
	
						
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ДоходыНоменклатураПриИзменении(Элемент)
	
	_ДоходыНоменклатураПриИзменении(Элементы.Доходы.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура _ДоходыНоменклатураПриИзменении(Строка)
	// --- 
	
	СтрокаТЧ = Объект.Доходы.НайтиПоИдентификатору(Строка);
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда 
		
		Если _ДС().НП.ПодставлятьСтавкуНДС Тогда
			СтрокаТЧ.СтавкаНДС =  CW_БухгалтерияЭкспедитораСерверПереопределяемый.СтавкаНДС(СтрокаТЧ.Номенклатура, Объект.Дата);
		КонецЕсли;
		//СтрокаТЧ.СтатьяЗатрат = СтрокаТЧ.Номенклатура.СтатьяЗатрат;

	КонецЕсли;
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ОчиститьДоходы(Команда)
	
	Объект.Доходы.Очистить();
	ОбновитьИтогиПоДоходам();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыСуммаПриИзменении(Элемент)
	
	ТД=Элементы.Доходы.ТекущиеДанные;
	ТД.НДС = ТД.Сумма * СтавкаНДС(ТД.СтавкаНДС)/100;
	ТД.Всего = ТД.Сумма + ТД.НДС;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыСтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСуммыСтроки(Элементы.Доходы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыНДСПриИзменении(Элемент)
	
	ТД = Элементы.Расходы.ТекущиеДанные;
	
	Если НЕ _ДС().НП.ОбратныйПересчетВДокументах Тогда
		ТД.Всего = ТД.Сумма + ТД.НДС;
	Иначе
		ТД.Сумма = ТД.Всего - ТД.НДС;
//		ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыВсегоПриИзменении(Элемент)
	
	ТД = Элементы.Доходы.ТекущиеДанные;
	
	Ставка = СтавкаНДС(ТД.СтавкаНДС)/100;
	ТД.НДС = ТД.Всего*Ставка/(1+Ставка);
	ТД.Сумма = ТД.Всего - ТД.НДС;
//	ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область ТаблицаВознаграждение 

&НаКлиенте
Процедура ВознаграждениеПриИзменении(Элемент)
	
	ОбновитьИтогиПоВознаграждению();
	
КонецПроцедуры

Процедура ОбновитьИтогиПоВознаграждению()
	
	// итоговая строка по табличной части "Услуги" 
	СВ = Строка(Валюта);
	ФЧ = "ЧЦ=15; ЧДЦ=2; ЧН=";
	Элементы.СтраницаВознаграждение.Заголовок = "Вознаграждение ("+Строка(Объект.Вознаграждение.Количество())+")";
	Если Объект.Вознаграждение.Количество() = 0 Тогда
		ИтогоПоВознаграждению = "Нет данных.";
	Иначе
		СуммаВознаграждения = Объект.Вознаграждение.Итог("Всего");
		ИтогоПоВознаграждению =	"Строк: "+Объект.Вознаграждение.Количество()+
						";  Сумма: "+Формат(Объект.Вознаграждение.Итог("Сумма"),ФЧ)+" "+СВ+ 
						";  НДС: "+Формат(Объект.Вознаграждение.Итог("НДС"),ФЧ)+" "+СВ+
						";  Всего: "+Формат(Объект.Вознаграждение.Итог("Всего"),ФЧ)+" " +СВ;
	КонецЕсли;
	
						
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ВознаграждениеНоменклатураПриИзменении(Элемент)
	
	_ВознаграждениеНоменклатураПриИзменении(Элементы.Вознаграждение.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура _ВознаграждениеНоменклатураПриИзменении(Строка)
	// --- 
	
	СтрокаТЧ = Объект.Вознаграждение.НайтиПоИдентификатору(Строка);
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда 
		
		СтрокаТЧ.Представление = СтрокаТЧ.Номенклатура.НаименованиеПолное +" "+ СокрЛП(СтрокаТЧ.Грузоперевозка);
		Если _ДС().НП.ПодставлятьСтавкуНДС Тогда
			СтрокаТЧ.СтавкаНДС =  CW_БухгалтерияЭкспедитораСерверПереопределяемый.СтавкаНДС(СтрокаТЧ.Номенклатура, Объект.Дата);
		КонецЕсли;

	КонецЕсли;
	
	// пробуем переформировать представление номенклатуры
	ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
	
	ПараметрыШаблона.Номенклатура 	= СтрокаТЧ.Номенклатура;
	ПараметрыШаблона.Объект 		= Объект;
	ПараметрыШаблона.Дата 			= Объект.Дата;
	ПараметрыШаблона.Договор 		= Объект.Договор;
	ПараметрыШаблона.ВидДоговора 	= Объект.Договор.ВидДоговора;
	ПараметрыШаблона.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
	
	CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(СтрокаТЧ, ПараметрыШаблона); 
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ОчиститьВознаграждение(Команда)
	
	Объект.Вознаграждение.Очистить();
	ОбновитьИтогиПоВознаграждению();
	
КонецПроцедуры

&НаКлиенте
Процедура ВознаграждениеКоличествоПриИзменении(Элемент)
	
	ПересчитатьСуммыСтроки(Элементы.Вознаграждение.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВознаграждениеЦенаПриИзменении(Элемент)
	
	ПересчитатьСуммыСтроки(Элементы.Вознаграждение.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВознаграждениеСуммаПриИзменении(Элемент)
	
	ТД			= Элементы.Вознаграждение.ТекущиеДанные;
	ТД.НДС 		= ТД.Сумма * СтавкаНДС(ТД.СтавкаНДС)/100;
	ТД.Всего 	= ТД.Сумма + ТД.НДС;
	ТД.Цена 	= _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	
КонецПроцедуры

&НаКлиенте
Процедура ВознаграждениеСтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСуммыСтроки(Элементы.Вознаграждение.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВознаграждениеНДСПриИзменении(Элемент)
	
	ТД = Элементы.Вознаграждение.ТекущиеДанные;
	
	Если НЕ _ДС().НП.ОбратныйПересчетВДокументах Тогда
		ТД.Всего = ТД.Сумма + ТД.НДС;
	Иначе
		ТД.Сумма = ТД.Всего - ТД.НДС;
		ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВознаграждениеВсегоПриИзменении(Элемент)
	
	ТД = Элементы.Вознаграждение.ТекущиеДанные;
	
	Ставка = СтавкаНДС(ТД.СтавкаНДС)/100;
	ТД.НДС = ТД.Всего*Ставка/(1+Ставка);
	ТД.Сумма = ТД.Всего - ТД.НДС;
	ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура РасходыГрузоперевозкаПриИзменении(Элемент)
	ЗаполнитьДобавленныеКолонкиТаблиц("Расходы");
КонецПроцедуры

&НаКлиенте
Процедура ДоходыГрузоперевозкаПриИзменении(Элемент)
	ЗаполнитьДобавленныеКолонкиТаблиц("Доходы");
КонецПроцедуры


&НаСервере
Процедура ПодготовитьДанныеФормы()
	
	ЗаполнитьДобавленныеКолонкиТаблиц("Расходы");
	ЗаполнитьДобавленныеКолонкиТаблиц("Доходы");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц(ИмяТабличнойЧасти)
	
	МассивГрузоперевозок 	= Объект[ИмяТабличнойЧасти].Выгрузить().ВыгрузитьКолонку("Грузоперевозка");
	СвойстваГрузоперевозок 	= CW_Грузоперевозки_Сервер.ПолучитьСведенияПоГрузоперевозкам(МассивГрузоперевозок);

	Для каждого СтрокаДокумента Из Объект[ИмяТабличнойЧасти] Цикл

		СтруктураСвойств = СвойстваГрузоперевозок.Получить(СтрокаДокумента.Грузоперевозка);
		
		Если СтруктураСвойств <> Неопределено Тогда
			 СтруктураСвойств.Свойство("ПометкаУдаления",СтрокаДокумента.ГрузоперевозкаУдалена);
		Конецесли;
		
	КонецЦикла;
	
КонецПроцедуры



// ---------------------------------------------------------------------------- 
// КОМАНДЫ
// ---------------------------------------------------------------------------- 

#Область ЗаполнениеВознаграждения 

&НаКлиенте
Процедура ЗаполнитьВознаграждение(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Аналитика) Тогда 
		_УФК.ВывестиПредупреждение("Не выбрана аналитика!");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		_УФК.ВывестиПредупреждение("Не выбран контрагент!");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.Договор) Тогда 
		_УФК.ВывестиПредупреждение("Не выбран договор!");
		Возврат;
	КонецЕсли;
	
	// ---------------------------------------------------------------------------- 
	
	Если ВалютаРегламентированногоУчетаРубль Тогда
		Если (Объект.Вознаграждение.Количество() <> 0 ИЛИ Объект.Расходы.Количество() <> 0 ИЛИ Объект.Доходы.Количество() <> 0) Тогда
			
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаОчисткиТабличныхЧастей",ЭтотОбъект); 
			ПоказатьВопрос(ПОВ,"Табличные части ""Вознаграждение"", ""Расходы"" и ""Доходы"" будут очищены! Продолжить?", РежимДиалогаВопрос.ДаНет);
			
		Иначе
			
			ЗаполнитьВознаграждениеЭтап2();
			
		КонецЕсли; 
		
	Иначе
		
		Если  Объект.Расходы.Количество() <> 0 ИЛИ Объект.Доходы.Количество() <> 0 Тогда
			
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаОчисткиТабличныхЧастей",ЭтотОбъект); 
			ПоказатьВопрос(ПОВ,"Табличные части ""Расходы"" и ""Доходы"" будут очищены! Продолжить?", РежимДиалогаВопрос.ДаНет);
			
		Иначе
			
			ЗаполнитьВознаграждениеЭтап2();
			
		КонецЕсли; 
	
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОчисткиТабличныхЧастей(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.Да) Тогда
		ЗаполнитьВознаграждениеЭтап2();
	КонецЕсли;	
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВознаграждениеЭтап2()
	// --- 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораСтавкиНДСДляЗаполнения",ЭтотОбъект); 
	СписокСтавокНДС = ПолучитьСписокСтавокНДС(Объект.Дата);
	СписокСтавокНДС.ПоказатьВыборЭлемента(ПОВ,"Выберите ставку НДС");
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбораСтавкиНДСДляЗаполнения(Ставка, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ставка = Неопределено) Тогда
		
		_УФК.ВывестиПредупреждение("Не выбрана ставка НДС!");
		
	Иначе	
		
		Ответ = _ЗаполнитьВознаграждение(Ставка.Значение);
		Если (НЕ _УФКС.ВыполненоУспешно(Ответ)) Тогда
			_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
		КонецЕсли; 
		
		ОбновитьИтогиПоРасходам();
		ОбновитьИтогиПоДоходам();
		
		Если ВалютаРегламентированногоУчетаРубль Тогда
			ОбновитьИтогиПоВознаграждению();
		КонецЕсли;
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  
  

&НаСервереБезКонтекста
Функция ПолучитьСписокСтавокНДС(ДатаДокумента) 
	
	СписокСтавокНДС = Новый СписокЗначений; 
	
	Для Каждого ЗначениеПеречисления Из Перечисления.СтавкиНДС Цикл
		СписокСтавокНДС.Добавить(ЗначениеПеречисления);
	КонецЦикла;
	
	Возврат СписокСтавокНДС;
	
КонецФункции

&НаСервере
Функция _ЗаполнитьВознаграждение(Ставка);
	// --- 
	
	// обновляем параметры
	_СформироватьОбщиеПараметры();
	
	Объект.Вознаграждение.Очистить();
	Объект.Расходы.Очистить();
	Объект.Доходы.Очистить();
	
	// ---------------------------------------------------------------------------- 
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	CW_ПеревыставлениеПоСтавкамОбороты.Регистратор КАК Регистратор,
	                      |	CW_ПеревыставлениеПоСтавкамОбороты.Грузоперевозка КАК Грузоперевозка,
	                      |	CW_ПеревыставлениеПоСтавкамОбороты.Номенклатура КАК Номенклатура,
	                      |	CW_ПеревыставлениеПоСтавкамОбороты.СтавкаНДС КАК СтавкаНДС,
	                      |	CW_ПеревыставлениеПоСтавкамОбороты.ВсегоПриход КАК ВсегоРубПриход,
	                      |	CW_ПеревыставлениеПоСтавкамОбороты.ВсегоРасход КАК ВсегоРубРасход,
	                      |	CW_ПеревыставлениеПоСтавкамОбороты.СуммаПриход КАК СуммаРубПриход,
	                      |	CW_ПеревыставлениеПоСтавкамОбороты.СуммаРасход КАК СуммаРубРасход,
	                      |	CW_ПеревыставлениеПоСтавкамОбороты.НДСПриход КАК НДСРубПриход,
	                      |	CW_ПеревыставлениеПоСтавкамОбороты.НДСРасход КАК НДСРубРасход,
	                      |	CW_ПеревыставлениеПоСтавкамОбороты.Регистратор.ПредставлениеДокумента КАК РегистраторПредставлениеДокумента
	                      |ИЗ
	                      |	РегистрНакопления.CW_ПеревыставлениеПоСтавкам.Обороты(
	                      |			,
	                      |			&КонПериода,
	                      |			Регистратор,
	                      |			Контрагент = &Контрагент
	                      |				И Договор = &ДоговорКонтрагента
						//Подсистема.УчетПриложенийДоговоров	
	                      |				И ПриложениеКДоговору = &ПриложениеКДоговору
						//Подсистема.УчетПриложенийДоговоров	
	                      |				И ВЫБОР
	                      |					КОГДА &ПоЗаказу = ИСТИНА
	                      |						ТОГДА Грузоперевозка.Заказ = &Заказ
	                      |					ИНАЧЕ Грузоперевозка = &Грузоперевозка
	                      |				КОНЕЦ) КАК CW_ПеревыставлениеПоСтавкамОбороты
	                      |ГДЕ
	                      |	CW_ПеревыставлениеПоСтавкамОбороты.Регистратор.Организация = &Организация
	                      |	И ВЫБОР
	                      |			КОГДА &ВестиУчетПоПодразделениям
	                      |				ТОГДА CW_ПеревыставлениеПоСтавкамОбороты.Регистратор.ПодразделениеОрганизации = &ПодразделениеОрганизации
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ");
						  
	Запрос.УстановитьПараметр("Контрагент"			, Объект.Контрагент);					  
	Запрос.УстановитьПараметр("ДоговорКонтрагента"	, Объект.Договор);					  
	
	//Подсистема.УчетПриложенийДоговоров	
	Запрос.УстановитьПараметр("ПриложениеКДоговору"	, Объект.ПриложениеКДоговору);					  
	//Подсистема.УчетПриложенийДоговоров
	
	Запрос.УстановитьПараметр("КонПериода"			, КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ПоЗаказу"			, Объект.ЗакрытиеПоЗаказу); 
	
	Запрос.УстановитьПараметр("Организация"					, Объект.Организация);					  
	Запрос.УстановитьПараметр("ПодразделениеОрганизации"	, Объект.ПодразделениеОрганизации);					  
	Запрос.УстановитьПараметр("ВестиУчетПоПодразделениям"	, ВестиУчетПоПодразделениям);					  
	
	Если Объект.ЗакрытиеПоЗаказу Тогда
		
		Запрос.УстановитьПараметр("Заказ", Объект.Аналитика);
		Запрос.УстановитьПараметр("Грузоперевозка", Справочники.CW_Грузоперевозки.ПустаяСсылка());
		
	Иначе
		
		Запрос.УстановитьПараметр("Заказ", Справочники.CW_Заказы.ПустаяСсылка());
		Запрос.УстановитьПараметр("Грузоперевозка", Объект.Аналитика);
		
	КонецЕсли; 
		
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТЗ Цикл
		
		Если ТипЗнч(Стр.Регистратор) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
			
			НовСтрока = Объект.Расходы.Добавить();
			// --- 
			НовСтрока.Грузоперевозка = Стр.Грузоперевозка;
			НовСтрока.Номенклатура = Стр.Номенклатура;
			НовСтрока.Сумма = Стр.СуммаРубПриход;
			НовСтрока.СтавкаНДС = Стр.СтавкаНДС;
			НовСтрока.НДС = Стр.НДСРубПриход;
			НовСтрока.Всего = Стр.ВсегоРубПриход;
			НовСтрока.РасходыПоГрузоперевозке = Стр.Регистратор;
			НовСтрока.Представление = Стр.РегистраторПредставлениеДокумента;
			
		ИначеЕсли ТипЗнч(Стр.Регистратор) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда 	
			
			НовСтрока = Объект.Доходы.Добавить();
			// --- 
			НовСтрока.Грузоперевозка = Стр.Грузоперевозка;
			НовСтрока.Номенклатура = Стр.Номенклатура;
			НовСтрока.Сумма = Стр.СуммаРубРасход;
			НовСтрока.СтавкаНДС = Стр.СтавкаНДС;
			НовСтрока.НДС = Стр.НДСРубРасход;
			НовСтрока.Всего = Стр.ВсегоРубРасход;
			НовСтрока.ДоходыПоГрузоперевозке = Стр.Регистратор;
			НовСтрока.Представление = Стр.РегистраторПредставлениеДокумента;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	ПараметрыДоговора = _ДС().ПД;

	// агентское вознаграждение...
	//----------------------------
	
	ТЗРасходы = Объект.Расходы.Выгрузить();
	ТЗДоходы = Объект.Доходы.Выгрузить();
	
	// группируем по грузоперевозкам
	Если ВалютаРегламентированногоУчетаРубль Тогда
		Если Объект.ЗакрытиеПоЗаказу Тогда
			
			НовСтрока = Объект.Вознаграждение.Добавить();
			// --- 			
			НовСтрока.Номенклатура = ПараметрыДоговора.Номенклатура;
			НовСтрока.Представление = Строка(НовСтрока.Номенклатура.НаименованиеПолное);
			НовСтрока.НоменклатурнаяГруппа = НовСтрока.Номенклатура.НоменклатурнаяГруппа;
			НовСтрока.Количество = 1;
			НовСтрока.Всего = ТЗДоходы.Итог("Всего") - ТЗРасходы.Итог("Всего");
			
			НовСтрока.СтавкаНДС = Ставка;	
			
			СтавкаНДСПроцент = CW_Финансы.ПолучитьСтавкуНДС(НовСтрока.СтавкаНДС)/100;
			НовСтрока.НДС = НовСтрока.Всего*СтавкаНДСПроцент/(1+СтавкаНДСПроцент);
			НовСтрока.Сумма = НовСтрока.Всего - НовСтрока.НДС;
			НовСтрока.Цена = _сф.БезопасноРазделить(НовСтрока.Сумма,НовСтрока.Количество);
			
		Иначе	
			
			МассивГП = _сф.м_СоздатьИзКолонкиТЗ(ТЗ,"Грузоперевозка");
			Для каждого ГП Из МассивГП Цикл
				
				НовСтрока = Объект.Вознаграждение.Добавить();
				
				Отбор = _сф.ст_Отбор("Грузоперевозка",ГП);
				ТЗР = ТЗРасходы.Скопировать(Отбор);
				ТЗД = ТЗДоходы.Скопировать(Отбор);
				
				НовСтрока.Номенклатура = ПараметрыДоговора.Номенклатура;
				НовСтрока.Представление = Строка(НовСтрока.Номенклатура.НаименованиеПолное);
				НовСтрока.НоменклатурнаяГруппа = НовСтрока.Номенклатура.НоменклатурнаяГруппа;
				НовСтрока.Количество = 1;
				НовСтрока.Всего = ТЗД.Итог("Всего") - ТЗР.Итог("Всего");
				
				НовСтрока.СтавкаНДС = Ставка;	
				
				СтавкаНДСПроцент = CW_Финансы.ПолучитьСтавкуНДС(НовСтрока.СтавкаНДС)/100;
				НовСтрока.НДС = НовСтрока.Всего*СтавкаНДСПроцент/(1+СтавкаНДСПроцент);
				НовСтрока.Сумма = НовСтрока.Всего - НовСтрока.НДС;
				НовСтрока.Цена = _сф.БезопасноРазделить(НовСтрока.Сумма,НовСтрока.Количество);		
				
			КонецЦикла;	
			
		КонецЕсли; 
	КонецЕсли;
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

#КонецОбласти 

#Область ПолучениеНомера 

&НаКлиенте
Процедура ПолучитьНомер(Команда)
	
	// автоматическая установка номера возможно 
	// только если задана организация
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		_УФК.ВывестиПредупреждение("Для автоматической установки нового номера
					   |необходимо выбрать организацию.",10);
		Возврат;
	КонецЕсли;
	
	// получаем новый номер
	СтарыйНомер = Объект.Номер;
	_ПолучитьНомер();
	
	// если изменился номер, то попытаемся его переприсвоить первичным документам
	Если СтарыйНомер <> Объект.Номер Тогда
		НомерПриИзменении(ЭтаФорма.ТекущийЭлемент);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура _ПолучитьНомер()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
		// если ввели не пустой номер, то проверим на 
	// возможность изменения номера первичных документов
	Если Не ЗначениеЗаполнено(Объект.Номер) Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат;
	КонецЕсли;
	Если Не _ИспользуетсяПакетнаяНумерация() Тогда
		 Возврат;
	КонецЕсли;
	
	// спросим у пользователя
	ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУстановкиНовогоНомераПервичнымДокументам",ЭтотОбъект); 
	ПоказатьВопрос(ПОВ,"Установить новый номер первичным документам?", РежимДиалогаВопрос.ДаНет);  
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаУстановкиНовогоНомераПервичнымДокументам(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.Да) Тогда
		
		// устанавливаем
		Объект.НомерАкта = Объект.Номер;
		Если Объект.ДатаАкта = Дата(1,1,1) Тогда
			Объект.ДатаАкта = Объект.Дата;						
		КонецЕсли;
		Если Объект.ФормируетсяСчетФактура Тогда
			Объект.НомерСчетаФактуры = Объект.Номер;
			Если Объект.ДатаСчетаФактуры = Дата(1,1,1) Тогда
				Если Объект.ДатаАкта = Дата(1,1,1) Тогда
					Объект.ДатаСчетаФактуры = Объект.Дата;
				Иначе
					Объект.ДатаСчетаФактуры = Объект.ДатаАкта;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// регенерируем форму	
		_ОбновитьНомераДокументов();
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ИспользуетсяПакетнаяНумерация()
	
	ПорядокПрисвоенияНомеров = CW_Настройки.ПараметрУчетнойПолитики(Объект.Дата,Объект.Организация,"ПорядокПрисвоенияНомеров");
	Если (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты) Или
		 (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация)	
	Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВедомыйДокументОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// проверяем существование счета
	Если НЕ Объект.ВедомыйДокумент.Пустая() Тогда
		
		ПоказатьЗначение(,Объект.ВедомыйДокумент);
		
	Иначе
		
		_УФК.ВывестиПредупреждение("Ведомый документ реализации ещё не сформирован.");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				ТекущийОбъект.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		ТекущийОбъект.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, ТекущийОбъект.Дата);
	

	Если Не ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет тогда
		
		ТекущийОбъект.ФормируетсяСчетФактура = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
			
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	

	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти


//Первичные документы
&НаКлиенте
Процедура НомерАктаПриИзменении(Элемент)
	НомерАктаПриИзмененииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура НомерАктаОчистка(Элемент, СтандартнаяОбработка)
	НомерАктаПриИзмененииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура НомерАктаПриИзмененииНаКлиенте()
	
	// значение номера не пустое	
	Если ЗначениеЗаполнено(Объект.НомерАкта) Тогда
		
		// Если заполнили номер документа, а дата пустая, 
		// то установим ее равной дате документа
		Если Не ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
			
			Объект.ДатаАкта = Объект.Дата;			
			
			// если изменили дату акта, то нужно убедиться в том,
			// что дата акта совпадает с датой с/ф...
			Если ЗначениеЗаполнено(Объект.ДатаСчетаФактуры) Тогда
				Объект.ДатаСчетаФактуры = Объект.ДатаАкта;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	_ОбновитьНомераДокументов();

	// регенерируем форму
	ПервичныеДокументыУправлениеЭлементамиФормы();

КонецПроцедуры

&НаКлиенте
Процедура ДатаАктаПриИзменении(Элемент)
	
	ДатаАктаПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаАктаОчистка(Элемент, СтандартнаяОбработка)
	
	ДатаАктаПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаАктаПриИзмененииНаКлиенте()
	
	// если очистили дату акта, то принудительно очистим номер документа,
	// т.к. порядок установки даты акта в этом случае будет не определен.
	// В таком случае система при проведении заново присвоит новый номер 
	// акта и установит ему дату, равной дате документа 
	Если Не ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
		Объект.НомерАкта = "";
		
		// аналогично поступаем со с/ф
		Объект.НомерСчетаФактуры = "";
		Объект.ДатаСчетаФактуры = Дата(1,1,1);
		Возврат;
	КонецЕсли;
	
	// если не формируется счет, то дата акта не может быть меньше даты документа
	Если Объект.ДатаАкта < Объект.Дата Тогда
		Объект.ДатаАкта = Объект.Дата;			
	КонецЕсли;
	
	// дата акта всегда должна совпадать с датой с/ф
	Если Объект.ДатаАкта <> Объект.ДатаСчетаФактуры Тогда
		Объект.ДатаСчетаФактуры = Объект.ДатаАкта;
	КонецЕсли;
	
	_ОбновитьНомераДокументов();
	//// регенерируем форму
	ПервичныеДокументыУправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыВремяАкта(Команда)
	
	ДополнительныеПараметры = Новый Структура("НачальнаяДата",Объект.ДатаАкта);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияДатыАкта",ЭтотОбъект,ДополнительныеПараметры); 
	ПоказатьВводДаты(ОписаниеОповещения,Объект.ДатаАкта,"Время акта",ЧастиДаты.Время);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияДатыАкта(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// переносим введённое время в дату акта
	ДатаАктаСтрокой 	= Формат(ДополнительныеПараметры.НачальнаяДата,"ДФ=yyyyMMdd");
	ВремяАктаСтрокой 	= Формат(РезультатВыбора,"ДФ=HHmmss");
	
	Объект.ДатаАкта 	= Дата(ДатаАктаСтрокой+ВремяАктаСтрокой);
	
	// синхронизируем время счета-фактуры
	Если ЗначениеЗаполнено(Объект.ДатаСчетаФактуры) Тогда
		Объект.ДатаСчетаФактуры = Объект.ДатаАкта;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормируетсяСчетФактураПриИзменении(Элемент)
	
	Если Объект.ФормируетсяСчетФактура Тогда
		// выполним проверку на соответствие даты акта (и соответственно с/ф) дате документа
		ДатаАктаПриИзмененииНаКлиенте();
	Иначе
		Объект.НомерСчетаФактуры = "";
		Объект.ДатаСчетаФактуры = Неопределено;
	КонецЕсли; 
	
	_ОбновитьНомераДокументов();

	ПервичныеДокументыУправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаФактурыПриИзменении(Элемент)
	
	НомерСчетаФактурыПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаФактурыОчистка(Элемент, СтандартнаяОбработка)
	
	НомерСчетаФактурыПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаФактурыПриИзмененииНаКлиенте()
	
	// если очистили номер документа, то очистим дату с/ф, 
	// т.к. в этом случае дата с/ф будет принудительно сформирована на основании даты акта
	Если Не ЗначениеЗаполнено(Объект.НомерСчетаФактуры) Тогда
		Объект.ДатаСчетаФактуры = Дата(1,1,1);
		
	// номер заполнили 
	Иначе
		
		// дата с/ф должна совпадать с датой акта или датой документа (в случае отсутствия акта)
		Если Не ЗначениеЗаполнено(Объект.ДатаСчетаФактуры) Тогда
			Объект.ДатаСчетаФактуры = ?(ЗначениеЗаполнено(Объект.ДатаАкта), Объект.ДатаАкта, Объект.Дата);
		КонецЕсли;
	КонецЕсли;
	
	_ОбновитьНомераДокументов();
	// регенерируем форму
	ПервичныеДокументыУправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыНомерСчетФактуры(Команда)
	
	// для пакетной нумерации нужен номер документа
	Если (Не ЗначениеЗаполнено(Объект.Дата)) и _ИспользуетсяПакетнаяНумерация() Тогда
		ПоказатьПредупреждение(,"Для автоматического присвоения номера счет-фактуры 
						|необходимо установить номер документа.");
		Возврат;
	КонецЕсли;
	
	// установить номер с/ф можно только при наличии даты акта
	Если Объект.ДатаАкта = Дата(1,1,1) Тогда
			ПоказатьПредупреждение(,"Для автоматического присвоения номера счет-фактуры 
						|необходимо установить дату акта.");
		Возврат;
	КонецЕсли;
	
	УстановитьНомерСчетаФактурыНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНомерСчетаФактурыНаКлиенте()
	
	ПорядокПрисвоенияНомеров = _ДС().УП.ПорядокПрисвоенияНомеров;

	// если дата не задана, то устанавливаем ее равной акту
	СтарыйНомерСчетаФактуры = Объект.НомерСчетаФактуры;
	Если Объект.ДатаСчетаФактуры = Дата(1,1,1) Тогда
		Объект.ДатаСчетаФактуры = Объект.ДатаАкта;
	КонецЕсли;
	
	Если ПорядокПрисвоенияНомеров = ПредопределенноеЗначение("Перечисление.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты") ИЛИ
		ПорядокПрисвоенияНомеров =  ПредопределенноеЗначение("Перечисление.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация") 
		Тогда
		
		Объект.НомерСчетаФактуры = Объект.Номер;
		
	ИначеЕсли ПорядокПрисвоенияНомеров =  ПредопределенноеЗначение("Перечисление.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация") Тогда 
		
		Объект.НомерСчетаФактуры = ПолучитьНомерСчетаФактурыНаСервере();
	
	ИначеЕсли ПорядокПрисвоенияНомеров =  ПредопределенноеЗначение("Перечисление.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор") Тогда 
		
		ВнешщнийНумераторУстановитьНомерСчетаФактурыНаСервере();
		
	КонецЕсли; 
	
	// если не удалось установить номер с/ф, то восстановим дату с/ф
	Если Не ЗначениеЗаполнено(Объект.НомерСчетаФактуры) Тогда
		Объект.НомерСчетаФактуры = СтарыйНомерСчетаФактуры;
	КонецЕсли;
	
	_ОбновитьНомераДокументов();
	
КонецПроцедуры


&НаСервере
Процедура ПервичныеДокументыПриСозданииНаСервере()
	
	ПравоРедактированияНомеровПервичныхДокументов = CW_ПраваДоступа.ПравоДоступно("РедактированиеНомеровПервичныхДокументов");
	
	Элементы.НомерАкта.Доступность 					= ПравоРедактированияНомеровПервичныхДокументов;
	Элементы.ПервичныеДокументыНомерАкта.Видимость 	= ПравоРедактированияНомеровПервичныхДокументов;
	Элементы.НомерСчетаФактуры.Доступность 					= ПравоРедактированияНомеровПервичныхДокументов;
	Элементы.ПервичныеДокументыНомерСчетФактуры.Видимость 	= ПравоРедактированияНомеровПервичныхДокументов;
	
	ПервичныеДокументыУправлениеЭлементамиФормы();
	

КонецПроцедуры

&НаСервере
Процедура ПервичныеДокументыУправлениеЭлементамиФормы()
	
	// акт
	Элементы.ГруппаПараметрыСчетаФактуры.Доступность  = Объект.ФормируетсяСчетФактура;
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыНомерАкта(Команда)

	// для пакетной нумерации нужен номер документа
	Если (Не ЗначениеЗаполнено(Объект.Номер)) и _ИспользуетсяПакетнаяНумерация() Тогда
		ПоказатьПредупреждение(,"Для автоматического присвоения номера акта 
						|необходимо установить номер документа.",10);
		Возврат;
	КонецЕсли;
	
	// присваиваем номер
	ПервичныеДокументыНомерАктаНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыНомерАктаНаКлиенте()
	
	ПорядокПрисвоенияНомеров = _ДС().УП.ПорядокПрисвоенияНомеров;

	// если дата акта не задана
	СтараяДатаАкта = Объект.ДатаАкта;
	Если Объект.ДатаАкта = Дата(1,1,1) Тогда
		Объект.ДатаАкта = Объект.Дата;
	КонецЕсли; 
	
	Если ПорядокПрисвоенияНомеров = ПредопределенноеЗначение("Перечисление.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты") ИЛИ
		 ПорядокПрисвоенияНомеров = ПредопределенноеЗначение("Перечисление.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация") 
	Тогда
		
		Объект.НомерАкта = Объект.Номер;
		
	ИначеЕсли ПорядокПрисвоенияНомеров = ПредопределенноеЗначение("Перечисление.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация") Тогда 
		
		ПолучитьНомерАктаНаСервере();
		
	ИначеЕсли ПорядокПрисвоенияНомеров = ПредопределенноеЗначение("Перечисление.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор") Тогда 
		
		ВнешнийНумераторУстановитьНомерАктаНаСервере();
		
	КонецЕсли; 
	
	// если не удалось установить номер акта, то восстановим дату акта
	Если Не ЗначениеЗаполнено(Объект.НомерАкта) Тогда
		Объект.ДатаАкта = СтараяДатаАкта;
	КонецЕсли;
	
	_ОбновитьНомераДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ВнешнийНумераторУстановитьНомерАктаНаСервере()
	
	ВнешнийНумератор = _ДС().УП.ВнешнийНумератор;
	ОбработкаНумерации = _ПО.ПолучитьОбработку(ВнешнийНумератор);
	ОбработкаНумерации.УстановитьНомерАкта(Объект);

КонецПроцедуры

&НаСервере
Процедура ВнешщнийНумераторУстановитьНомерСчетаФактурыНаСервере()
	
	
	ВнешнийНумератор = _ДС().УП.ВнешнийНумератор;
	ОбработкаНумерации = _ПО.ПолучитьОбработку(ВнешнийНумератор);
	ОбработкаНумерации.УстановитьНомерСчетаФактуры(Объект);

КонецПроцедуры


&наСервере
Функция ПолучитьНомерСчетаФактурыНаСервере()
	
	НовыйСФ = Документы.СчетФактураВыданный.СоздатьДокумент();
	НовыйСФ.ВидСчетаФактуры=Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию;
	НовыйСФ.Организация = Объект.Организация;
	НовыйСФ.Дата = Объект.ДатаСчетаФактуры;
	НовыйСФ.УстановитьНовыйНомер();
	
	НомерСФ = НовыйСФ.Номер;
	
	НовыйСФ = Неопределено;
	
	Возврат НомерСФ;
	
КонецФункции

&наСервере
Функция ПолучитьНомерАктаНаСервере()
	
	НовыйАкт = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйАкт.Организация = Объект.Организация;
	НовыйАкт.Дата = Объект.ДатаАкта;
	НовыйАкт.УстановитьНовыйНомер();
	// --- 
	НомерАкта = НовыйАкт.Номер;
	НовыйАкт = Неопределено;
	
	
	Возврат НомерАкта;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры

// ----------------------------------------------------------------------------
